reports/taurus-artifacts/merged.yml
---
execution:
- concurrency: 10
  hold-for: 1m
  ramp-up: 5s
  scenario: api_test
reporting:
- module: console
- module: final-stats
- module: junit-xml
scenarios:
  api_test:
    requests:
    - label: Get Post 1
      method: GET
      url: http://api:8080/get
    - body:
        body: This is a test post
        title: Test Post
        userId: 1
      headers:
        Content-Type: application/json
      label: Create Post
      method: POST
      url: http://api:8080/post